
Функция ВыполнитьТяжелыйКод(ДатаНачала, ДатаОкончания, МассивДоговор) Экспорт
	
	//для создание процентной шкалы
	КоличествоЭлементовМассива = МассивДоговор.Количество();
	Сч = 1;
	
	Для Каждого ДоговорРеализации Из МассивДоговор Цикл
		
		//получаю документ
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &ДатаНачала
		|	И РеализацияТоваровУслуг.Дата <= &ДатаОкончания";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда //проверяю есть ли документы
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ДокументРеализации = ВыборкаДетальныеЗаписи.Ссылка;
				ПолученныйДокумент = ДокументРеализации.ПолучитьОбъект();  
				ПолученныйДокумент.Услуги.Очистить();
				
				АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "ВКМ_СуммаАбонентскойПлаты");
				
				ПолученныйДокумент.ВКМ_ВыполнитьАвтозаполнение(ПолученныйДокумент);
				
			КонецЦикла;
			
		Иначе   //если документ не создан
			
			АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорРеализации, "ВКМ_СуммаАбонентскойПлаты");
			ОрганизацияИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорРеализации, "Организация");
			КонтрагентИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорРеализации, "Владелец");
				
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = КонецМесяца(ДатаОкончания);
			НовыйДокумент.Договор = ДоговорРеализации;
			НовыйДокумент.Контрагент = КонтрагентИзДоговора;
			НовыйДокумент.Организация = ОрганизацияИзДоговора;
			НовыйДокумент.Записать();
				
			НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение(НовыйДокумент);
				
		КонецЕсли;
		
		ПолученныйДокумент.Записать();  
		
		//сообщаю прогресс, увеличиваю счетчик
		ДлительныеОперации.СообщитьПрогресс(Сч/КоличествоЭлементовМассива*100); 
		Сч = Сч + 1;
	
	КонецЦикла;
	
	Возврат "Обработка выполнена"; 
	
КонецФункции
