
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ПриОткрытииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ЗначениеПараметра") Тогда
	
		Для Каждого Строка Из Параметры.ЗначениеПараметра Цикл

			Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
			Серия = ДГ.УстановитьСерию(Объект.Год);
		
			Значение = ДГ.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = Строка.ДатаНачала;
			Интервал.Конец = Строка.ДатаОкончания;
			
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ДГ.Очистить();
	ДГ.Обновление = Ложь;
	
	ДанныеФормы = РеквизитФормыВЗначение("Объект");
	
	//строю непосредственно с данных таблицы
	Для Каждого СтрокаТаблицы Из Объект.ОтпускаСотрудников Цикл
	
		Точка = ДГ.УстановитьТочку(СтрокаТаблицы.Сотрудник);
		Серия = ДГ.УстановитьСерию(Объект.Год);
		
		Значение = ДГ.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТаблицы.ДатаНачала;
		Интервал.Конец = СтрокаТаблицы.ДатаОкончания;	
	
	КонецЦикла;
	
	//строю через запрос
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДГ.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серия = ДГ.УстановитьСерию(Объект.Год);
		
		Значение = ДГ.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ДатаНачала;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ДатаОконичания;
		
	КонецЦикла;
	
	ДГ.Обновление = Истина;

КонецПроцедуры
#КонецОбласти

