
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДГ.Очистить();
	ДГ.ОтображатьПустыеЗначения = Ложь;
	
	Счетчик = 0;
	
	//проверяю заполнен ли адрес	
	Если ЗначениеЗаполнено(Параметры.Адрес)  Тогда

		//получаю ТЗ из временного хранилища и строю диаграмму
		ДанныеТЗ = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		
		Для Каждого Строка Из ДанныеТЗ Цикл

			Счетчик = Счетчик + 1;
			
			Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
			Точка.Текст = Строка.Сотрудник;
			Серия = ДГ.УстановитьСерию(Счетчик);
			
			МесяцОтпуска = Формат(Строка.ДатаНачала,"ДФ=ММММ");
			СтрокаТекстаСерии = МесяцОтпуска + " (Дней-" + (Строка.КоличествоДней + 1) + ")";
			Серия.Текст = СтрокаТекстаСерии;
		
			Значение = ДГ.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = Строка.ДатаНачала;
			Интервал.Конец = Строка.ДатаОкончания;
			
		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
