
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//считаю количество дней отпуска, для подсветки строки
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.КоличествоДнейОтпуска = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	//считаю количество дней отпуска при изменении текущей строки
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущаяСтрока.КоличествоДнейОтпуска = (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала) / 86400;

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	//передаю параметры открытия через струтуру помещая во временное хранилище
	
	ПараметрыОткрытия = ДанныеФормы();
		
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыОткрытия, ТекущийЭлемент);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ДанныеФормы() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания,
		|		ДЕНЬ) КАК КоличествоДней
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	//выгружаю ТЗ
	ТЗВыборка = РезультатЗапроса.Выгрузить();  
	
	//помещаю во временное хранилище
	АдресВременногоХранилищаТЗ = ПоместитьВоВременноеХранилище(ТЗВыборка);  
	
	//помещаю в структуру и передаю параметром формы
	СтруктураПараметров = Новый Структура;                      	 
	СтруктураПараметров.Вставить("Адрес", АдресВременногоХранилищаТЗ);
	
	Возврат СтруктураПараметров;

КонецФункции
#КонецОбласти
