
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//делаю видимыми или нет некоторые добавленные объекты
	//++ Сергеев П.С. изменения в рамках дипломного проекта
	Если Объект.ВКМ_ВидыДоговоровКонтрагентов = Перечисления.ВКМ_ВидыДоговоровКонтрагентов.АбонентскаяПлата Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;
	//++ Сергеев П.С. изменения в рамках дипломного проекта

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидыДоговоровКонтрагентовПриИзменении(Элемент)

	//делаю видимыми или нет некоторые при изменении вида договора
	//++ Сергеев П.С. изменения в рамках дипломного проекта
	Если Объект.ВКМ_ВидыДоговоровКонтрагентов = ПредопределенноеЗначение("Перечисление.ВКМ_ВидыДоговоровКонтрагентов.АбонентскаяПлата") Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;
	//++ Сергеев П.С. изменения в рамках дипломного проекта			

КонецПроцедуры
#КонецОбласти
