
Функция ВыполнитьДлительнуюОперацию(ДатаНачала, ДатаОкончания, ДоговорРеализации) Экспорт 
	
	//получаю документ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &ДатаНачала
		|	И РеализацияТоваровУслуг.Дата <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда //проверяю есть ли документы

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			ДокументРеализации = ВыборкаДетальныеЗаписи.Ссылка;
			ПолученныйДокумент = ДокументРеализации.ПолучитьОбъект();  
			ПолученныйДокумент.Услуги.Очистить();
		
			АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "ВКМ_СуммаАбонентскойПлаты");
		
			ПолученныйДокумент.ВКМ_ВыполнитьАвтозаполнение(ПолученныйДокумент);
		
		КонецЦикла;
		
	Иначе   //если документ не создан
		
		Для Каждого Строка Из ДоговорРеализации Цикл
			
			АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "ВКМ_СуммаАбонентскойПлаты");
			ОрганизацияИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Организация");
			КонтрагентИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Владелец");
		
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = КонецМесяца(ДатаОкончания);
			НовыйДокумент.Договор = Строка.Договор;
			НовыйДокумент.Контрагент = КонтрагентИзДоговора;
			НовыйДокумент.Организация = ОрганизацияИзДоговора;
			НовыйДокумент.Записать();
			
			НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение(НовыйДокумент);

		КонецЦикла;
		
	КонецЕсли;
	
	ПолученныйДокумент.Записать();
	
КонецФункции

