
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СозданиеРеализации(Команда)
	
	ДлительнаяОперация = СозданиеРеализацииДлительнаяОперация();
	
	//задаю параметры длительной операции с выводом шкалы выполнения
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОповещениеОПрогрессе", ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);  //клиентская процедура
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СозданиеРеализацииДлительнаяОперация()
	
	МассивДоговор = Новый Массив;
	//получаю договора реализации и помещаю их в массив для передачи параметром в длительную операцию
	Для Каждого Договор Из Объект.ДоговорРеализация Цикл
		СсылкаНаРеализацию = Договор.Договор;
		МассивДоговор.Добавить(СсылкаНаРеализацию);
	КонецЦикла;
	
	//длительная операция работает либо в модуле менеджере, либо в обшем модуле, создал в модуль менеджере обработки
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьТяжелыйКод", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания, МассивДоговор);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте  
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	//получаем результат из временного хранилища БСП
	Если Результат.Статус = "Выполнено" Тогда
		Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте  
Процедура ОповещениеОПрогрессе(Результат, ДополнительныеПараметры) Экспорт
	
	//получаем прогресс из временного хранилища БСП
	Если Результат.Прогресс <> Неопределено Тогда
		Состояние("Выполняется длительный код", Результат.Прогресс.Процент);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
