
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СозданиеРеализации(Команда)
	
	//таже процедура автозаполнения из модуля документа, только перенес ее сюда. не получилось достучаться до процедуры автозаполнения
	СозданиеРеализацииНаСервере();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СозданиеРеализацииНаСервере()
	
	//получаю значение констант
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(АбонентскаяПлата) Тогда
		ОбщегоНазначения.СообщитьПользователю("Абонентская плата не заполнена");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
		ОбщегоНазначения.СообщитьПользователю("Работы специалиста не заполены");
		Возврат;
	КонецЕсли;
	
	//получаю документы реализация товаров и услуг в выбранном диапазоне
	//если они есть, заполняю таблицу услуги
	//если их нет, создаю документ и заполняю таблицу услуги
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &ДатаНачала
		|	И РеализацияТоваровУслуг.Дата <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда //проверяю есть ли документы
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДокументРеализации = ВыборкаДетальныеЗаписи.Ссылка;
		ПолученныйДокумент = ДокументРеализации.ПолучитьОбъект();  
		ПолученныйДокумент.Услуги.Очистить();
		
		АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "ВКМ_СуммаАбонентскойПлаты");
			
		СозданиеСтрокиТЧ(АбонентскаяПлата, АбонентскаяПлатаИзДоговора, ПолученныйДокумент, РаботыСпециалиста);
					
		КонецЦикла;
		
		
	Иначе   //если документ не создан
		
		Для Каждого Строка Из Объект.ДоговорРеализация Цикл
			
			АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "ВКМ_СуммаАбонентскойПлаты");
			ОрганизацияИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Организация");
			КонтрагентИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Владелец");
		
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Договор = Строка.Договор;
			НовыйДокумент.Контрагент = КонтрагентИзДоговора;
			НовыйДокумент.Организация = ОрганизацияИзДоговора;
			
			СозданиеСтрокиТЧ(АбонентскаяПлата, АбонентскаяПлатаИзДоговора, НовыйДокумент, РаботыСпециалиста);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Заполнение документов закончено";
	Сообщение.Сообщить();

	//ДлительноеФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне(ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(ДокументРеализацииСсылка), ПараметрыЗапуска, ПараметрыВыполнения);	

КонецПроцедуры

&НаСервере
Процедура СозданиеСтрокиТЧ(Знач АбонентскаяПлата, Знач АбонентскаяПлатаИзДоговора, Знач ПолученныйДокумент, Знач РаботыСпециалиста)
	
	Перем ВыборкаДетальныеЗаписи, НоваяСтрока, РезультатЗапроса, СуммаДокумента;
	
	Если АбонентскаяПлатаИзДоговора > 0 Тогда
		
		НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
		НоваяСтрока.Номенклатура = АбонентскаяПлата;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = АбонентскаяПлатаИзДоговора;
		НоваяСтрока.Сумма = АбонентскаяПлатаИзДоговора; 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0)) КАК СуммаКОплате,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0)) КАК КоличествоЧасов
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			Клиент = &Клиент
	|				И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Клиент", ПолученныйДокумент.Контрагент);	
	Запрос.УстановитьПараметр("Договор", ПолученныйДокумент.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СуммаКОплате > 0 Тогда
			НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = РаботыСпециалиста;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасов;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате;
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате;
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаДокумента = ПолученныйДокумент.Товары.Итог("Сумма") + ПолученныйДокумент.Услуги.Итог("Сумма");
	
	ПолученныйДокумент.Записать();

КонецПроцедуры
#КонецОбласти
