
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СозданиеРеализации(Команда)
	
	//Из ДоговораКонтрагента получить все договора в указанную дат
	//затем запустить обработку автозаполенния
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ДатаНачала", Объект.Период.ДатаНачала);
	ПараметрыЗапуска.Вставить("ДатаОкончания", Объект.Период.ДатаОкончания);
	
	СозданиеРеализацииНаСервере(ПараметрыЗапуска);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СозданиеРеализацииНаСервере(ПараметрыЗапуска)
	
	ДокументРеализацииСсылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(); //как-то надо получить объект
	Если ЗначениеЗаполнено(ДокументРеализацииСсылка) Тогда
		ДокументРеализации = ДокументРеализацииСсылка.ПолучитьОбъект();
		ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(ДокументРеализацииСсылка);  //выполняется не через длительные операции, для проверки
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Создание реализации";
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
		ДлительноеФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне(ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(ДокументРеализацииСсылка), ПараметрыЗапуска, ПараметрыВыполнения);	
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
