
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СозданиеРеализации(Команда)
	
	//таже процедура автозаполнения из модуля документа, только перенес ее сюда. не получилось достучаться до процедуры автозаполнения
	ДлительнаяОперация = СозданиеРеализацииДлительнаяОперация();

	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = ТекстСообщения;
	//Сообщение.Сообщить();
	
	////задаем параметры длительной операции с выводом шкалы выполнения
	//ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.Интервал = 1;
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//
	//ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);  //клиентская процедура
	//
	//ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СозданиеРеализацииДлительнаяОперация()
	
	ДлительнаяОперацияОбщийМодуль = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "ВКМ_ДлительнаяОперация.ВыполнитьДлительнуюОперацию", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	ДлительнаяОперацияОбщийМодуль = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "ВКМ_ДлительнаяОперация.ВыполнитьДлительнуюОперацию", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания, Объект.ДоговорРеализация);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьДлительнуюОперацию", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания, Объект.ДоговорРеализация);
	
КонецФункции

&НаКлиенте  
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	////получаем результат из временного хранилища БСП
	//Если Результат.Статус = "Выполнено" Тогда
	//	Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
	//КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
