
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СозданиеРеализации(Команда)
	
	//таже процедура автозаполнения из модуля документа, только перенес ее сюда. не получилось достучаться до процедуры автозаполнения
	ТекстСообщения = СозданиеРеализацииДлительнаяОперация();

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	////задаем параметры длительной операции с выводом шкалы выполнения, оставил возможность реализации со шкалой
	//ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.Интервал = 1;
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//
	//ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);  //клиентская процедура
	//
	//ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СозданиеРеализацииДлительнаяОперация()
	
	//получаю документ
	//ДокументРеализацииПериод = Документы.РеализацияТоваровУслуг.Выбрать(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	//ПолученныйДокумент = ДокументРеализацииПериод.ПолучитьОбъект();
	
	//получаю значение констант
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(АбонентскаяПлата) Тогда
		//ОбщегоНазначения.СообщитьПользователю("Абонентская плата не заполнена");
		ТекстСообщения = "Абонентская плата не заполнена";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
		//ОбщегоНазначения.СообщитьПользователю("Работы специалиста не заполены");
		ТекстСообщения = "Работы специалиста не заполены";
	КонецЕсли;
	
	//получаю документы реализация товаров и услуг в выбранном диапазоне
	//если они есть, заполняю таблицу услуги
	//если их нет, создаю документ и заполняю таблицу услуги
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &ДатаНачала
		|	И РеализацияТоваровУслуг.Дата <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда //проверяю есть ли документы
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДокументРеализации = ВыборкаДетальныеЗаписи.Ссылка;
		ПолученныйДокумент = ДокументРеализации.ПолучитьОбъект();  
		ПолученныйДокумент.Услуги.Очистить();
		
		АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "ВКМ_СуммаАбонентскойПлаты");
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
		"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьДлительнуюОперацию", ПолученныйДокумент);
		//длительная операция должна обязательно работать через модуль менеджера. Функция ВыполнитьДлительнуюОперацию написана именно там
	
		//СозданиеСтрокиТЧ(АбонентскаяПлата, АбонентскаяПлатаИзДоговора, ПолученныйДокумент, РаботыСпециалиста);
					
		КонецЦикла;
		
		
	Иначе   //если документ не создан
		
		Для Каждого Строка Из Объект.ДоговорРеализация Цикл
			
			АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "ВКМ_СуммаАбонентскойПлаты");
			ОрганизацияИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Организация");
			КонтрагентИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Владелец");
		
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Договор = Строка.Договор;
			НовыйДокумент.Контрагент = КонтрагентИзДоговора;
			НовыйДокумент.Организация = ОрганизацияИзДоговора;
			
			СозданиеСтрокиТЧ(АбонентскаяПлата, АбонентскаяПлатаИзДоговора, НовыйДокумент, РаботыСпециалиста);
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = "Заполнение документов закончено";
	//Сообщение.Сообщить();
	
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = "Заполнение документов закончено";
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Процедура СозданиеСтрокиТЧ(Знач АбонентскаяПлата, Знач АбонентскаяПлатаИзДоговора, Знач ПолученныйДокумент, Знач РаботыСпециалиста)
	
	Перем ВыборкаДетальныеЗаписи, НоваяСтрока, РезультатЗапроса, СуммаДокумента;
	
	Если АбонентскаяПлатаИзДоговора > 0 Тогда
		
		НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
		НоваяСтрока.Номенклатура = АбонентскаяПлата;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = АбонентскаяПлатаИзДоговора;
		НоваяСтрока.Сумма = АбонентскаяПлатаИзДоговора; 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0)) КАК СуммаКОплате,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0)) КАК КоличествоЧасов
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			Клиент = &Клиент
	|				И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Клиент", ПолученныйДокумент.Контрагент);	
	Запрос.УстановитьПараметр("Договор", ПолученныйДокумент.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СуммаКОплате > 0 Тогда
			НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = РаботыСпециалиста;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасов;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате;
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате;
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаДокумента = ПолученныйДокумент.Товары.Итог("Сумма") + ПолученныйДокумент.Услуги.Итог("Сумма");
	
	ПолученныйДокумент.Записать();

КонецПроцедуры


//&НаКлиенте  
//Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
//	
//	//получаем результат из временного хранилища БСП
//	Если Результат.Статус = "Выполнено" Тогда
//		Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
//	КонецЕсли;
//		
//КонецПроцедуры


//&НаСервере
//Процедура СозданиеРеализацииНаСервере()
//	
//	//получаю значение констант
//	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
//	РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
//	
//	Если Не ЗначениеЗаполнено(АбонентскаяПлата) Тогда
//		ОбщегоНазначения.СообщитьПользователю("Абонентская плата не заполнена");
//		Возврат;
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
//		ОбщегоНазначения.СообщитьПользователю("Работы специалиста не заполены");
//		Возврат;
//	КонецЕсли;
//	
//	//получаю документы реализация товаров и услуг в выбранном диапазоне
//	//если они есть, заполняю таблицу услуги
//	//если их нет, создаю документ и заполняю таблицу услуги
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
//		|	РеализацияТоваровУслуг.Договор КАК Договор
//		|ИЗ
//		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		|ГДЕ
//		|	РеализацияТоваровУслуг.Дата >= &ДатаНачала
//		|	И РеализацияТоваровУслуг.Дата <= &ДатаОкончания";
//	
//	Запрос.УстановитьПараметр("ДатаНачала", Объект.Период.ДатаНачала);
//	Запрос.УстановитьПараметр("ДатаОкончания", Объект.Период.ДатаОкончания);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда //проверяю есть ли документы
//		
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		ДокументРеализации = ВыборкаДетальныеЗаписи.Ссылка;
//		ПолученныйДокумент = ДокументРеализации.ПолучитьОбъект();  
//		ПолученныйДокумент.Услуги.Очистить();
//		
//		АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Договор, "ВКМ_СуммаАбонентскойПлаты");
//		
//		СозданиеСтрокиТЧ(АбонентскаяПлата, АбонентскаяПлатаИзДоговора, ПолученныйДокумент, РаботыСпециалиста);
//					
//		КонецЦикла;
//		
//		
//	Иначе   //если документ не создан
//		
//		Для Каждого Строка Из Объект.ДоговорРеализация Цикл
//			
//			АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "ВКМ_СуммаАбонентскойПлаты");
//			ОрганизацияИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Организация");
//			КонтрагентИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Владелец");
//		
//			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
//			НовыйДокумент.Дата = ТекущаяДата();
//			НовыйДокумент.Договор = Строка.Договор;
//			НовыйДокумент.Контрагент = КонтрагентИзДоговора;
//			НовыйДокумент.Организация = ОрганизацияИзДоговора;
//			
//			СозданиеСтрокиТЧ(АбонентскаяПлата, АбонентскаяПлатаИзДоговора, НовыйДокумент, РаботыСпециалиста);
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Сообщение = Новый СообщениеПользователю;
//	Сообщение.Текст = "Заполнение документов закончено";
//	Сообщение.Сообщить();

//	//ДлительноеФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне(ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(ДокументРеализацииСсылка), ПараметрыЗапуска, ПараметрыВыполнения);	

//КонецПроцедуры

#КонецОбласти
